benchmark-results/round-3-intel/dragonfly - --num_shards=1 --conn_io_threads=1.txt
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       738754.63          ---          ---         2.07716         2.11100         2.27100         2.35100         2.60700         2.91100         3.43900         3.58300         3.98300        29.43900     48977.85 
Gets            0.00         0.00         0.00             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals     738754.63         0.00         0.00         2.07716         2.11100         2.27100         2.35100         2.60700         2.91100         3.43900         3.58300         3.98300        29.43900     48977.85 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        79092.23          ---          ---         1.75815         1.78300         1.91900         1.99100         2.19100         2.39900         2.76700         2.86300         3.15100         8.95900      5251.74 
Gets       790913.62      4328.22    786585.41         1.75802         1.78300         1.91900         1.99100         2.19100         2.39900         2.75100         2.86300         3.15100         8.95900     31754.79 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals     870005.85      4328.22    786585.41         1.75803         1.78300         1.91900         1.99100         2.19100         2.39900         2.75100         2.86300         3.15100         8.95900     37006.53 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        19291.82          ---          ---         0.90555         0.90300         1.00700         1.07900         1.27100         1.39100         1.49500         1.58300         1.95100         2.94300      1280.96 
Gets       192892.71      1137.31    191755.40         0.90414         0.90300         1.00700         1.07900         1.27100         1.39100         1.47900         1.52700         1.68700         2.09500      7746.25 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals     212184.53      1137.31    191755.40         0.90427         0.90300         1.00700         1.07900         1.27100         1.39100         1.47900         1.52700         1.70300         2.94300      9027.21 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        72649.05          ---          ---         1.92278         1.94300         2.07900         2.15900         2.39900         2.67100         3.11900         3.40700         5.66300         7.61500      4816.49 
Gets       726482.47    726482.47         0.00         1.92269         1.94300         2.07900         2.15900         2.39900         2.67100         3.11900         3.39100         5.66300         7.61500     44616.95 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals     799131.52    726482.47         0.00         1.92270         1.94300         2.07900         2.15900         2.39900         2.67100         3.11900         3.39100         5.66300         7.61500     49433.43 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        23891.20          ---          ---         0.73016         0.71900         0.82300         0.87900         1.04700         1.18300         1.43900         1.53500         1.83100         2.28700      1583.87 
Gets       238880.44    238880.44         0.00         0.72974         0.71900         0.82300         0.87900         1.04700         1.18300         1.42300         1.51100         1.77500         3.11900     14670.75 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals     262771.64    238880.44         0.00         0.72978         0.71900         0.82300         0.87900         1.04700         1.18300         1.42300         1.51900         1.77500         3.11900     16254.62